modm-ext/archive-stmicro-svd/header_stm32f410r8i3.svd
        <register>
          <name>CR5</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR5</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR5</name>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR5</name>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR5</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR5</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR5</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR5</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR5</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR5</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR5</name>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR5</name>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR6</name>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR6</name>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR6</name>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR6</name>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR6</name>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR6</name>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR6</name>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR6</name>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR6</name>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR6</name>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR6</name>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR6</name>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR7</name>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CR7</name>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR7</name>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NDTR7</name>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR7</name>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PAR7</name>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR7</name>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M0AR7</name>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR7</name>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M1AR7</name>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR7</name>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FCR7</name>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <baseAddress>0x40080000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNGEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DRDY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CECS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
        </register>
